{
    "description":  "",
    "name":  "M365 Baseline - Microsoft_Office_2016",
    "platforms":  "windows10",
    "technologies":  "mdm",
    "templateReference":  {
                              "templateId":  "90316f12-246d-44c6-a767-f87692e86083_2",
                              "templateFamily":  "baseline",
                              "templateDisplayName":  "Microsoft 365 Apps for Enterprise Security Baseline",
                              "templateDisplayVersion":  "Version 2306"
                          },
    "roleScopeTagIds":  [
                            "0"
                        ],
    "settings":  [
                     {
                         "id":  "45",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_gloabloptions~l_customize_l_noextensibilitycustomizationfromdocumentpolicy",
                                                 "settingInstanceTemplateReference":  {
                                                                                          "settingInstanceTemplateId":  "0edbc77f-b477-423b-963c-60dc05606b25"
                                                                                      },
                                                 "choiceSettingValue":  {
                                                                            "value":  "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_gloabloptions~l_customize_l_noextensibilitycustomizationfromdocumentpolicy_1",
                                                                            "settingValueTemplateReference":  {
                                                                                                                  "settingValueTemplateId":  "3a48383f-21cd-4a40-9e8c-797d30e248ad",
                                                                                                                  "useTemplateDefault":  false
                                                                                                              },
                                                                            "children":  [
                                                                                             {
                                                                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                 "settingDefinitionId":  "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_gloabloptions~l_customize_l_noextensibilitycustomizationfromdocumentpolicy_l_noextensibilitycustomizationfromdocumentpolicypowerpoint",
                                                                                                 "settingInstanceTemplateReference":  {
                                                                                                                                          "settingInstanceTemplateId":  "bb253159-796d-4dbe-8849-ffd094ea64f8"
                                                                                                                                      },
                                                                                                 "choiceSettingValue":  {
                                                                                                                            "value":  "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_gloabloptions~l_customize_l_noextensibilitycustomizationfromdocumentpolicy_l_noextensibilitycustomizationfromdocumentpolicypowerpoint_1",
                                                                                                                            "settingValueTemplateReference":  {
                                                                                                                                                                  "settingValueTemplateId":  "4b12309d-7a14-4c05-acfe-8e4ade7bdd41",
                                                                                                                                                                  "useTemplateDefault":  false
                                                                                                                                                              },
                                                                                                                            "children":  [

                                                                                                                                         ]
                                                                                                                        }
                                                                                             },
                                                                                             {
                                                                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                 "settingDefinitionId":  "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_gloabloptions~l_customize_l_noextensibilitycustomizationfromdocumentpolicy_l_noextensibilitycustomizationfromdocumentpolicypublisher",
                                                                                                 "settingInstanceTemplateReference":  {
                                                                                                                                          "settingInstanceTemplateId":  "5cd0532c-2ccc-4862-93a7-4f8ab2b0aefc"
                                                                                                                                      },
                                                                                                 "choiceSettingValue":  {
                                                                                                                            "value":  "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_gloabloptions~l_customize_l_noextensibilitycustomizationfromdocumentpolicy_l_noextensibilitycustomizationfromdocumentpolicypublisher_1",
                                                                                                                            "settingValueTemplateReference":  {
                                                                                                                                                                  "settingValueTemplateId":  "56190f02-e884-4fed-aa7c-7c5ee2043dff",
                                                                                                                                                                  "useTemplateDefault":  false
                                                                                                                                                              },
                                                                                                                            "children":  [

                                                                                                                                         ]
                                                                                                                        }
                                                                                             },
                                                                                             {
                                                                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                 "settingDefinitionId":  "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_gloabloptions~l_customize_l_noextensibilitycustomizationfromdocumentpolicy_l_noextensibilitycustomizationfromdocumentpolicyoutlook",
                                                                                                 "settingInstanceTemplateReference":  {
                                                                                                                                          "settingInstanceTemplateId":  "8379f028-4457-492e-aa32-becb27d0d156"
                                                                                                                                      },
                                                                                                 "choiceSettingValue":  {
                                                                                                                            "value":  "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_gloabloptions~l_customize_l_noextensibilitycustomizationfromdocumentpolicy_l_noextensibilitycustomizationfromdocumentpolicyoutlook_1",
                                                                                                                            "settingValueTemplateReference":  {
                                                                                                                                                                  "settingValueTemplateId":  "c6f77fa0-eb70-4648-a783-05de903897c7",
                                                                                                                                                                  "useTemplateDefault":  false
                                                                                                                                                              },
                                                                                                                            "children":  [

                                                                                                                                         ]
                                                                                                                        }
                                                                                             },
                                                                                             {
                                                                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                 "settingDefinitionId":  "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_gloabloptions~l_customize_l_noextensibilitycustomizationfromdocumentpolicy_l_noextensibilitycustomizationfromdocumentpolicyproject",
                                                                                                 "settingInstanceTemplateReference":  {
                                                                                                                                          "settingInstanceTemplateId":  "9641a6a5-b665-417c-9e0b-f53d7e3ee09e"
                                                                                                                                      },
                                                                                                 "choiceSettingValue":  {
                                                                                                                            "value":  "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_gloabloptions~l_customize_l_noextensibilitycustomizationfromdocumentpolicy_l_noextensibilitycustomizationfromdocumentpolicyproject_1",
                                                                                                                            "settingValueTemplateReference":  {
                                                                                                                                                                  "settingValueTemplateId":  "f9347b1b-c72d-4935-b829-7f58bcf63f44",
                                                                                                                                                                  "useTemplateDefault":  false
                                                                                                                                                              },
                                                                                                                            "children":  [

                                                                                                                                         ]
                                                                                                                        }
                                                                                             },
                                                                                             {
                                                                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                 "settingDefinitionId":  "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_gloabloptions~l_customize_l_noextensibilitycustomizationfromdocumentpolicy_l_noextensibilitycustomizationfromdocumentpolicyaccess",
                                                                                                 "settingInstanceTemplateReference":  {
                                                                                                                                          "settingInstanceTemplateId":  "3cd0efe7-2f9f-431e-bb0d-24ad28ea5dc4"
                                                                                                                                      },
                                                                                                 "choiceSettingValue":  {
                                                                                                                            "value":  "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_gloabloptions~l_customize_l_noextensibilitycustomizationfromdocumentpolicy_l_noextensibilitycustomizationfromdocumentpolicyaccess_1",
                                                                                                                            "settingValueTemplateReference":  {
                                                                                                                                                                  "settingValueTemplateId":  "ba3fa76f-6979-4b9a-abe4-ea98b1808570",
                                                                                                                                                                  "useTemplateDefault":  false
                                                                                                                                                              },
                                                                                                                            "children":  [

                                                                                                                                         ]
                                                                                                                        }
                                                                                             },
                                                                                             {
                                                                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                 "settingDefinitionId":  "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_gloabloptions~l_customize_l_noextensibilitycustomizationfromdocumentpolicy_l_noextensibilitycustomizationfromdocumentpolicyinfopath",
                                                                                                 "settingInstanceTemplateReference":  {
                                                                                                                                          "settingInstanceTemplateId":  "dcd6ec1c-d817-4a21-aa28-4c39fda25b4b"
                                                                                                                                      },
                                                                                                 "choiceSettingValue":  {
                                                                                                                            "value":  "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_gloabloptions~l_customize_l_noextensibilitycustomizationfromdocumentpolicy_l_noextensibilitycustomizationfromdocumentpolicyinfopath_1",
                                                                                                                            "settingValueTemplateReference":  {
                                                                                                                                                                  "settingValueTemplateId":  "da137ee2-288d-485d-ac31-9df8e2a6fc0f",
                                                                                                                                                                  "useTemplateDefault":  false
                                                                                                                                                              },
                                                                                                                            "children":  [

                                                                                                                                         ]
                                                                                                                        }
                                                                                             },
                                                                                             {
                                                                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                 "settingDefinitionId":  "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_gloabloptions~l_customize_l_noextensibilitycustomizationfromdocumentpolicy_l_noextensibilitycustomizationfromdocumentpolicyword",
                                                                                                 "settingInstanceTemplateReference":  {
                                                                                                                                          "settingInstanceTemplateId":  "e88a71f3-3c0e-4055-90c3-83189113a996"
                                                                                                                                      },
                                                                                                 "choiceSettingValue":  {
                                                                                                                            "value":  "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_gloabloptions~l_customize_l_noextensibilitycustomizationfromdocumentpolicy_l_noextensibilitycustomizationfromdocumentpolicyword_1",
                                                                                                                            "settingValueTemplateReference":  {
                                                                                                                                                                  "settingValueTemplateId":  "d3711299-740d-4574-b04e-c2989b9d1787",
                                                                                                                                                                  "useTemplateDefault":  false
                                                                                                                                                              },
                                                                                                                            "children":  [

                                                                                                                                         ]
                                                                                                                        }
                                                                                             },
                                                                                             {
                                                                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                 "settingDefinitionId":  "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_gloabloptions~l_customize_l_noextensibilitycustomizationfromdocumentpolicy_l_noextensibilitycustomizationfromdocumentpolicyexcel",
                                                                                                 "settingInstanceTemplateReference":  {
                                                                                                                                          "settingInstanceTemplateId":  "2b310492-4055-412a-a8d2-c8baf87bde7b"
                                                                                                                                      },
                                                                                                 "choiceSettingValue":  {
                                                                                                                            "value":  "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_gloabloptions~l_customize_l_noextensibilitycustomizationfromdocumentpolicy_l_noextensibilitycustomizationfromdocumentpolicyexcel_1",
                                                                                                                            "settingValueTemplateReference":  {
                                                                                                                                                                  "settingValueTemplateId":  "6eb564dd-7a51-4890-9c7d-4172d7ac08b2",
                                                                                                                                                                  "useTemplateDefault":  false
                                                                                                                                                              },
                                                                                                                            "children":  [

                                                                                                                                         ]
                                                                                                                        }
                                                                                             },
                                                                                             {
                                                                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                 "settingDefinitionId":  "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_gloabloptions~l_customize_l_noextensibilitycustomizationfromdocumentpolicy_l_noextensibilitycustomizationfromdocumentpolicyvisio",
                                                                                                 "settingInstanceTemplateReference":  {
                                                                                                                                          "settingInstanceTemplateId":  "6d32e6fc-7dd7-4e5c-887b-23d9b5b8b860"
                                                                                                                                      },
                                                                                                 "choiceSettingValue":  {
                                                                                                                            "value":  "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_gloabloptions~l_customize_l_noextensibilitycustomizationfromdocumentpolicy_l_noextensibilitycustomizationfromdocumentpolicyvisio_1",
                                                                                                                            "settingValueTemplateReference":  {
                                                                                                                                                                  "settingValueTemplateId":  "d4c3376c-b938-4ce8-a13c-3028ebc104d9",
                                                                                                                                                                  "useTemplateDefault":  false
                                                                                                                                                              },
                                                                                                                            "children":  [

                                                                                                                                         ]
                                                                                                                        }
                                                                                             }
                                                                                         ]
                                                                        }
                                             }
                     },
                     {
                         "id":  "46",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_securitysettings~l_trustcenter241_l_allowmixofpolicyanduserlocations",
                                                 "settingInstanceTemplateReference":  {
                                                                                          "settingInstanceTemplateId":  "a577e097-b496-44db-a8f1-72f3b1a1124c"
                                                                                      },
                                                 "choiceSettingValue":  {
                                                                            "value":  "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_securitysettings~l_trustcenter241_l_allowmixofpolicyanduserlocations_0",
                                                                            "settingValueTemplateReference":  {
                                                                                                                  "settingValueTemplateId":  "35b311cd-778f-42e7-905a-04bf05277b41",
                                                                                                                  "useTemplateDefault":  false
                                                                                                              },
                                                                            "children":  [

                                                                                         ]
                                                                        }
                                             }
                     },
                     {
                         "id":  "47",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_securitysettings_l_activexcontrolinitialization",
                                                 "settingInstanceTemplateReference":  {
                                                                                          "settingInstanceTemplateId":  "276bf7ed-e922-43a6-bbc4-c865d9dc0caf"
                                                                                      },
                                                 "choiceSettingValue":  {
                                                                            "value":  "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_securitysettings_l_activexcontrolinitialization_1",
                                                                            "settingValueTemplateReference":  {
                                                                                                                  "settingValueTemplateId":  "7f917d66-d05d-4dcf-a071-ff79ce294c28",
                                                                                                                  "useTemplateDefault":  false
                                                                                                              },
                                                                            "children":  [
                                                                                             {
                                                                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                 "settingDefinitionId":  "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_securitysettings_l_activexcontrolinitialization_l_activexcontrolinitializationcolon",
                                                                                                 "settingInstanceTemplateReference":  {
                                                                                                                                          "settingInstanceTemplateId":  "2f1745f9-6f63-4954-a87e-0b3d3e68d2d5"
                                                                                                                                      },
                                                                                                 "choiceSettingValue":  {
                                                                                                                            "value":  "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_securitysettings_l_activexcontrolinitialization_l_activexcontrolinitializationcolon_6",
                                                                                                                            "settingValueTemplateReference":  {
                                                                                                                                                                  "settingValueTemplateId":  "13a00f46-6603-4499-b929-5ba6462f3937",
                                                                                                                                                                  "useTemplateDefault":  false
                                                                                                                                                              },
                                                                                                                            "children":  [

                                                                                                                                         ]
                                                                                                                        }
                                                                                             }
                                                                                         ]
                                                                        }
                                             }
                     },
                     {
                         "id":  "48",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "user_vendor_msft_policy_config_office16v12~policy~l_microsoftofficesystem~l_securitysettings_l_basicauthproxybehavior",
                                                 "settingInstanceTemplateReference":  {
                                                                                          "settingInstanceTemplateId":  "4b175586-2575-4634-a53a-8e5fb964a4a2"
                                                                                      },
                                                 "choiceSettingValue":  {
                                                                            "value":  "user_vendor_msft_policy_config_office16v12~policy~l_microsoftofficesystem~l_securitysettings_l_basicauthproxybehavior_0",
                                                                            "settingValueTemplateReference":  {
                                                                                                                  "settingValueTemplateId":  "e0620e59-d986-4378-ad0c-ed3960122d44",
                                                                                                                  "useTemplateDefault":  false
                                                                                                              },
                                                                            "children":  [

                                                                                         ]
                                                                        }
                                             }
                     },
                     {
                         "id":  "49",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "user_vendor_msft_policy_config_office16v6~policy~l_microsoftofficesystem~l_securitysettings_l_allowvbaintranetrefs",
                                                 "settingInstanceTemplateReference":  {
                                                                                          "settingInstanceTemplateId":  "d6e938d0-c7b1-4dcd-b48b-4c48b85e6404"
                                                                                      },
                                                 "choiceSettingValue":  {
                                                                            "value":  "user_vendor_msft_policy_config_office16v6~policy~l_microsoftofficesystem~l_securitysettings_l_allowvbaintranetrefs_0",
                                                                            "settingValueTemplateReference":  {
                                                                                                                  "settingValueTemplateId":  "2cc94c04-d125-4ba8-8f25-9336946980ec",
                                                                                                                  "useTemplateDefault":  false
                                                                                                              },
                                                                            "children":  [

                                                                                         ]
                                                                        }
                                             }
                     },
                     {
                         "id":  "50",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_securitysettings_l_automationsecurity",
                                                 "settingInstanceTemplateReference":  {
                                                                                          "settingInstanceTemplateId":  "13018fe9-132b-4f47-8d85-8743ae0aad92"
                                                                                      },
                                                 "choiceSettingValue":  {
                                                                            "value":  "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_securitysettings_l_automationsecurity_1",
                                                                            "settingValueTemplateReference":  {
                                                                                                                  "settingValueTemplateId":  "ff00a7e4-8dbe-4611-9eba-a3af98ec6067",
                                                                                                                  "useTemplateDefault":  false
                                                                                                              },
                                                                            "children":  [
                                                                                             {
                                                                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                 "settingDefinitionId":  "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_securitysettings_l_automationsecurity_l_settheautomationsecuritylevel",
                                                                                                 "settingInstanceTemplateReference":  {
                                                                                                                                          "settingInstanceTemplateId":  "228c18dc-b607-4b44-832a-49f305d31ee5"
                                                                                                                                      },
                                                                                                 "choiceSettingValue":  {
                                                                                                                            "value":  "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_securitysettings_l_automationsecurity_l_settheautomationsecuritylevel_2",
                                                                                                                            "settingValueTemplateReference":  {
                                                                                                                                                                  "settingValueTemplateId":  "c93ea44e-22ea-4560-8be4-1f97686280f3",
                                                                                                                                                                  "useTemplateDefault":  false
                                                                                                                                                              },
                                                                                                                            "children":  [

                                                                                                                                         ]
                                                                                                                        }
                                                                                             }
                                                                                         ]
                                                                        }
                                             }
                     },
                     {
                         "id":  "51",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "user_vendor_msft_policy_config_office16v5~policy~l_microsoftofficesystem~l_securitysettings_l_authenticationfbabehavior",
                                                 "settingInstanceTemplateReference":  {
                                                                                          "settingInstanceTemplateId":  "9077d019-ffa6-4d60-87cc-97a2c64f3042"
                                                                                      },
                                                 "choiceSettingValue":  {
                                                                            "value":  "user_vendor_msft_policy_config_office16v5~policy~l_microsoftofficesystem~l_securitysettings_l_authenticationfbabehavior_1",
                                                                            "settingValueTemplateReference":  {
                                                                                                                  "settingValueTemplateId":  "13f11885-c9df-4325-a017-8d147a66c63a",
                                                                                                                  "useTemplateDefault":  false
                                                                                                              },
                                                                            "children":  [
                                                                                             {
                                                                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                                                                                                 "settingDefinitionId":  "user_vendor_msft_policy_config_office16v5~policy~l_microsoftofficesystem~l_securitysettings_l_authenticationfbabehavior_l_authenticationfbaenabledhostsid",
                                                                                                 "settingInstanceTemplateReference":  {
                                                                                                                                          "settingInstanceTemplateId":  "e2b9b93c-ede9-4cd0-84b1-030921640b0e"
                                                                                                                                      },
                                                                                                 "simpleSettingValue":  {
                                                                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                                                                                                            "value":  ";",
                                                                                                                            "settingValueTemplateReference":  {
                                                                                                                                                                  "settingValueTemplateId":  "f78fcebb-ceb6-415c-97cc-2aaa03ffc62a",
                                                                                                                                                                  "useTemplateDefault":  false
                                                                                                                                                              }
                                                                                                                        }
                                                                                             },
                                                                                             {
                                                                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                 "settingDefinitionId":  "user_vendor_msft_policy_config_office16v5~policy~l_microsoftofficesystem~l_securitysettings_l_authenticationfbabehavior_l_authenticationfbabehaviorenum",
                                                                                                 "settingInstanceTemplateReference":  {
                                                                                                                                          "settingInstanceTemplateId":  "ff693f09-d46d-410c-9ae6-c6122151bc53"
                                                                                                                                      },
                                                                                                 "choiceSettingValue":  {
                                                                                                                            "value":  "user_vendor_msft_policy_config_office16v5~policy~l_microsoftofficesystem~l_securitysettings_l_authenticationfbabehavior_l_authenticationfbabehaviorenum_1",
                                                                                                                            "settingValueTemplateReference":  {
                                                                                                                                                                  "settingValueTemplateId":  "20b6bd8f-63d0-436f-9aca-1094c11a08de",
                                                                                                                                                                  "useTemplateDefault":  false
                                                                                                                                                              },
                                                                                                                            "children":  [

                                                                                                                                         ]
                                                                                                                        }
                                                                                             }
                                                                                         ]
                                                                        }
                                             }
                     },
                     {
                         "id":  "52",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "user_vendor_msft_policy_config_office16v6~policy~l_microsoftofficesystem~l_securitysettings_l_disablestrictvbarefssecuritypolicy",
                                                 "settingInstanceTemplateReference":  {
                                                                                          "settingInstanceTemplateId":  "0c267d19-728e-4a9c-9ab9-95f474ac1f18"
                                                                                      },
                                                 "choiceSettingValue":  {
                                                                            "value":  "user_vendor_msft_policy_config_office16v6~policy~l_microsoftofficesystem~l_securitysettings_l_disablestrictvbarefssecuritypolicy_0",
                                                                            "settingValueTemplateReference":  {
                                                                                                                  "settingValueTemplateId":  "4d32b553-e564-4815-9926-974150d62127",
                                                                                                                  "useTemplateDefault":  false
                                                                                                              },
                                                                            "children":  [

                                                                                         ]
                                                                        }
                                             }
                     },
                     {
                         "id":  "53",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_securitysettings_l_disablealltrustbarnotificationsfor",
                                                 "settingInstanceTemplateReference":  {
                                                                                          "settingInstanceTemplateId":  "ba39c1f6-b3c2-4747-9aa0-516fd95bc3dd"
                                                                                      },
                                                 "choiceSettingValue":  {
                                                                            "value":  "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_securitysettings_l_disablealltrustbarnotificationsfor_0",
                                                                            "settingValueTemplateReference":  {
                                                                                                                  "settingValueTemplateId":  "fad14fa4-1729-41b7-a76b-cd90b77ac321",
                                                                                                                  "useTemplateDefault":  false
                                                                                                              },
                                                                            "children":  [

                                                                                         ]
                                                                        }
                                             }
                     },
                     {
                         "id":  "54",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "user_vendor_msft_policy_config_office16v14~policy~l_microsoftofficesystem~l_securitysettings_l_encryptiontypeforirm",
                                                 "settingInstanceTemplateReference":  {
                                                                                          "settingInstanceTemplateId":  "2b0c305f-e130-4be0-a329-5407fe930bb0"
                                                                                      },
                                                 "choiceSettingValue":  {
                                                                            "value":  "user_vendor_msft_policy_config_office16v14~policy~l_microsoftofficesystem~l_securitysettings_l_encryptiontypeforirm_1",
                                                                            "settingValueTemplateReference":  {
                                                                                                                  "settingValueTemplateId":  "3bd9f201-92e4-47c4-9596-68b918e0add9",
                                                                                                                  "useTemplateDefault":  false
                                                                                                              },
                                                                            "children":  [
                                                                                             {
                                                                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                 "settingDefinitionId":  "user_vendor_msft_policy_config_office16v14~policy~l_microsoftofficesystem~l_securitysettings_l_encryptiontypeforirm_l_encryptiontypeforirmcolon",
                                                                                                 "settingInstanceTemplateReference":  {
                                                                                                                                          "settingInstanceTemplateId":  "c7894867-37c3-45a2-8db8-11dd1abf039d"
                                                                                                                                      },
                                                                                                 "choiceSettingValue":  {
                                                                                                                            "value":  "user_vendor_msft_policy_config_office16v14~policy~l_microsoftofficesystem~l_securitysettings_l_encryptiontypeforirm_l_encryptiontypeforirmcolon_1",
                                                                                                                            "settingValueTemplateReference":  {
                                                                                                                                                                  "settingValueTemplateId":  "77f8482d-bced-49e6-8d1f-522b6da97e20",
                                                                                                                                                                  "useTemplateDefault":  false
                                                                                                                                                              },
                                                                                                                            "children":  [

                                                                                                                                         ]
                                                                                                                        }
                                                                                             }
                                                                                         ]
                                                                        }
                                             }
                     },
                     {
                         "id":  "55",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_securitysettings_l_encryptiontypeforpasswordprotectedoffice972003",
                                                 "settingInstanceTemplateReference":  {
                                                                                          "settingInstanceTemplateId":  "023bb233-00c2-4cc1-9939-4aa80e0a5472"
                                                                                      },
                                                 "choiceSettingValue":  {
                                                                            "value":  "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_securitysettings_l_encryptiontypeforpasswordprotectedoffice972003_1",
                                                                            "settingValueTemplateReference":  {
                                                                                                                  "settingValueTemplateId":  "c2423a9e-ee87-4f94-b064-0738bdd52d0b",
                                                                                                                  "useTemplateDefault":  false
                                                                                                              },
                                                                            "children":  [
                                                                                             {
                                                                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                                                                                                 "settingDefinitionId":  "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_securitysettings_l_encryptiontypeforpasswordprotectedoffice972003_l_encryptiontypecolon318",
                                                                                                 "settingInstanceTemplateReference":  {
                                                                                                                                          "settingInstanceTemplateId":  "fd77f429-0767-4726-b9b5-97da5a1a58ff"
                                                                                                                                      },
                                                                                                 "simpleSettingValue":  {
                                                                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                                                                                                            "value":  "Microsoft Enhanced RSA and AES Cryptographic Provider,AES 256,256",
                                                                                                                            "settingValueTemplateReference":  {
                                                                                                                                                                  "settingValueTemplateId":  "1cf82bce-b16c-4f26-92c5-f1b076323074",
                                                                                                                                                                  "useTemplateDefault":  false
                                                                                                                                                              }
                                                                                                                        }
                                                                                             }
                                                                                         ]
                                                                        }
                                             }
                     },
                     {
                         "id":  "56",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_securitysettings_l_encryptiontypeforpasswordprotectedofficeopen",
                                                 "settingInstanceTemplateReference":  {
                                                                                          "settingInstanceTemplateId":  "0ed4425c-d4f7-4929-8a27-d47f668e0432"
                                                                                      },
                                                 "choiceSettingValue":  {
                                                                            "value":  "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_securitysettings_l_encryptiontypeforpasswordprotectedofficeopen_1",
                                                                            "settingValueTemplateReference":  {
                                                                                                                  "settingValueTemplateId":  "f659b2df-6a81-46b6-9422-4d97e111556d",
                                                                                                                  "useTemplateDefault":  false
                                                                                                              },
                                                                            "children":  [
                                                                                             {
                                                                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                                                                                                 "settingDefinitionId":  "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_securitysettings_l_encryptiontypeforpasswordprotectedofficeopen_l_encryptiontypecolon",
                                                                                                 "settingInstanceTemplateReference":  {
                                                                                                                                          "settingInstanceTemplateId":  "f0ae5bbe-81b6-4041-91b3-4beef63558cd"
                                                                                                                                      },
                                                                                                 "simpleSettingValue":  {
                                                                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                                                                                                            "value":  "Microsoft Enhanced RSA and AES Cryptographic Provider,AES 256,256",
                                                                                                                            "settingValueTemplateReference":  {
                                                                                                                                                                  "settingValueTemplateId":  "726e1d9c-9d5d-4d37-be3c-5e32c545bb8f",
                                                                                                                                                                  "useTemplateDefault":  false
                                                                                                                                                              }
                                                                                                                        }
                                                                                             }
                                                                                         ]
                                                                        }
                                             }
                     },
                     {
                         "id":  "57",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_securitysettings_l_loadcontrolsinforms3",
                                                 "settingInstanceTemplateReference":  {
                                                                                          "settingInstanceTemplateId":  "b8e70d43-3ac3-4e96-8bf4-1c580faa1179"
                                                                                      },
                                                 "choiceSettingValue":  {
                                                                            "value":  "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_securitysettings_l_loadcontrolsinforms3_1",
                                                                            "settingValueTemplateReference":  {
                                                                                                                  "settingValueTemplateId":  "173e37ff-146c-4924-8c42-5601c35422f8",
                                                                                                                  "useTemplateDefault":  false
                                                                                                              },
                                                                            "children":  [
                                                                                             {
                                                                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                 "settingDefinitionId":  "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_securitysettings_l_loadcontrolsinforms3_l_loadcontrolsinforms3colon",
                                                                                                 "settingInstanceTemplateReference":  {
                                                                                                                                          "settingInstanceTemplateId":  "36ef02fe-a984-484c-82ee-8c16e0f7d0b2"
                                                                                                                                      },
                                                                                                 "choiceSettingValue":  {
                                                                                                                            "value":  "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_securitysettings_l_loadcontrolsinforms3_l_loadcontrolsinforms3colon_1",
                                                                                                                            "settingValueTemplateReference":  {
                                                                                                                                                                  "settingValueTemplateId":  "fdb6c9a7-5b84-47b4-938d-669dfecfcd00",
                                                                                                                                                                  "useTemplateDefault":  false
                                                                                                                                                              },
                                                                                                                            "children":  [

                                                                                                                                         ]
                                                                                                                        }
                                                                                             }
                                                                                         ]
                                                                        }
                                             }
                     },
                     {
                         "id":  "58",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_securitysettings_l_macroruntimescanscope",
                                                 "settingInstanceTemplateReference":  {
                                                                                          "settingInstanceTemplateId":  "18fc6930-5a1a-4cb2-8d29-2d24934f0788"
                                                                                      },
                                                 "choiceSettingValue":  {
                                                                            "value":  "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_securitysettings_l_macroruntimescanscope_1",
                                                                            "settingValueTemplateReference":  {
                                                                                                                  "settingValueTemplateId":  "c7481bcf-d704-428d-b8d0-2e310d8c6f07",
                                                                                                                  "useTemplateDefault":  false
                                                                                                              },
                                                                            "children":  [
                                                                                             {
                                                                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                 "settingDefinitionId":  "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_securitysettings_l_macroruntimescanscope_l_macroruntimescanscopeenum",
                                                                                                 "settingInstanceTemplateReference":  {
                                                                                                                                          "settingInstanceTemplateId":  "b1aa0808-601d-4bff-8942-4761617c409b"
                                                                                                                                      },
                                                                                                 "choiceSettingValue":  {
                                                                                                                            "value":  "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_securitysettings_l_macroruntimescanscope_l_macroruntimescanscopeenum_2",
                                                                                                                            "settingValueTemplateReference":  {
                                                                                                                                                                  "settingValueTemplateId":  "5e3ae836-26f8-409b-8493-9942b5b3ba24",
                                                                                                                                                                  "useTemplateDefault":  false
                                                                                                                                                              },
                                                                                                                            "children":  [

                                                                                                                                         ]
                                                                                                                        }
                                                                                             }
                                                                                         ]
                                                                        }
                                             }
                     },
                     {
                         "id":  "59",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_securitysettings_l_protectdocumentmetadataforrightsmanaged",
                                                 "settingInstanceTemplateReference":  {
                                                                                          "settingInstanceTemplateId":  "3c7f74db-b3fd-4b21-864e-d5782efa3478"
                                                                                      },
                                                 "choiceSettingValue":  {
                                                                            "value":  "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_securitysettings_l_protectdocumentmetadataforrightsmanaged_1",
                                                                            "settingValueTemplateReference":  {
                                                                                                                  "settingValueTemplateId":  "1738c031-fe13-434f-a859-01136d3c7459",
                                                                                                                  "useTemplateDefault":  false
                                                                                                              },
                                                                            "children":  [

                                                                                         ]
                                                                        }
                                             }
                     },
                     {
                         "id":  "60",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_serversettings_l_disabletheofficeclientfrompolling",
                                                 "settingInstanceTemplateReference":  {
                                                                                          "settingInstanceTemplateId":  "6e8fec50-99dd-4e4a-9f5f-ee00ba5fa51e"
                                                                                      },
                                                 "choiceSettingValue":  {
                                                                            "value":  "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_serversettings_l_disabletheofficeclientfrompolling_1",
                                                                            "settingValueTemplateReference":  {
                                                                                                                  "settingValueTemplateId":  "5cb1d134-6a61-4d0e-878a-e21aba529e4b",
                                                                                                                  "useTemplateDefault":  false
                                                                                                              },
                                                                            "children":  [

                                                                                         ]
                                                                        }
                                             }
                     },
                     {
                         "id":  "61",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_smartdocumentswordexcel_l_disablesmartdocumentsuseofmanifests",
                                                 "settingInstanceTemplateReference":  {
                                                                                          "settingInstanceTemplateId":  "c51d15d7-f9e7-4970-9cd9-4ad1562544fb"
                                                                                      },
                                                 "choiceSettingValue":  {
                                                                            "value":  "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_smartdocumentswordexcel_l_disablesmartdocumentsuseofmanifests_1",
                                                                            "settingValueTemplateReference":  {
                                                                                                                  "settingValueTemplateId":  "05fb59cb-89fa-48af-94e7-0d9a179092a9",
                                                                                                                  "useTemplateDefault":  false
                                                                                                              },
                                                                            "children":  [

                                                                                         ]
                                                                        }
                                             }
                     }
                 ]
}
