{
    "description":  "",
    "name":  "M365 Baseline - PowerPoint",
    "platforms":  "windows10",
    "technologies":  "mdm",
    "templateReference":  {
                              "templateId":  "90316f12-246d-44c6-a767-f87692e86083_2",
                              "templateFamily":  "baseline",
                              "templateDisplayName":  "Microsoft 365 Apps for Enterprise Security Baseline",
                              "templateDisplayVersion":  "Version 2306"
                          },
    "roleScopeTagIds":  [
                            "0"
                        ],
    "settings":  [
                     {
                         "id":  "76",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "user_vendor_msft_policy_config_ppt16v2~policy~l_ppt~l_powerpointoptions~l_security~l_trustcenter~l_fileblocksettings_l_powerpoint972003presentationsshowstemplatesandaddinfiles",
                                                 "settingInstanceTemplateReference":  {
                                                                                          "settingInstanceTemplateId":  "a884be5c-db9c-4dc1-b97e-759f666067f6"
                                                                                      },
                                                 "choiceSettingValue":  {
                                                                            "value":  "user_vendor_msft_policy_config_ppt16v2~policy~l_ppt~l_powerpointoptions~l_security~l_trustcenter~l_fileblocksettings_l_powerpoint972003presentationsshowstemplatesandaddinfiles_1",
                                                                            "settingValueTemplateReference":  {
                                                                                                                  "settingValueTemplateId":  "f37199d8-fd2d-4513-bc02-3f92441f1519",
                                                                                                                  "useTemplateDefault":  false
                                                                                                              },
                                                                            "children":  [
                                                                                             {
                                                                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                 "settingDefinitionId":  "user_vendor_msft_policy_config_ppt16v2~policy~l_ppt~l_powerpointoptions~l_security~l_trustcenter~l_fileblocksettings_l_powerpoint972003presentationsshowstemplatesandaddinfiles_l_powerpoint972003presentationsshowstemplatesandaddinfilesdropid",
                                                                                                 "settingInstanceTemplateReference":  {
                                                                                                                                          "settingInstanceTemplateId":  "412167d0-0333-4971-a9f2-1e63c343e871"
                                                                                                                                      },
                                                                                                 "choiceSettingValue":  {
                                                                                                                            "value":  "user_vendor_msft_policy_config_ppt16v2~policy~l_ppt~l_powerpointoptions~l_security~l_trustcenter~l_fileblocksettings_l_powerpoint972003presentationsshowstemplatesandaddinfiles_l_powerpoint972003presentationsshowstemplatesandaddinfilesdropid_2",
                                                                                                                            "settingValueTemplateReference":  {
                                                                                                                                                                  "settingValueTemplateId":  "6825a230-b06b-4f23-b77d-534ab2761d66",
                                                                                                                                                                  "useTemplateDefault":  false
                                                                                                                                                              },
                                                                                                                            "children":  [

                                                                                                                                         ]
                                                                                                                        }
                                                                                             }
                                                                                         ]
                                                                        }
                                             }
                     },
                     {
                         "id":  "77",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "user_vendor_msft_policy_config_ppt16v2~policy~l_microsoftofficepowerpoint~l_powerpointoptions~l_security~l_trustcenter~l_fileblocksettings_l_setdefaultfileblockbehavior",
                                                 "settingInstanceTemplateReference":  {
                                                                                          "settingInstanceTemplateId":  "50c713eb-87d0-4ebf-b464-d933a25de869"
                                                                                      },
                                                 "choiceSettingValue":  {
                                                                            "value":  "user_vendor_msft_policy_config_ppt16v2~policy~l_microsoftofficepowerpoint~l_powerpointoptions~l_security~l_trustcenter~l_fileblocksettings_l_setdefaultfileblockbehavior_1",
                                                                            "settingValueTemplateReference":  {
                                                                                                                  "settingValueTemplateId":  "cbf782df-0854-4a7e-97d1-4249bcffe254",
                                                                                                                  "useTemplateDefault":  false
                                                                                                              },
                                                                            "children":  [
                                                                                             {
                                                                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                 "settingDefinitionId":  "user_vendor_msft_policy_config_ppt16v2~policy~l_microsoftofficepowerpoint~l_powerpointoptions~l_security~l_trustcenter~l_fileblocksettings_l_setdefaultfileblockbehavior_l_setdefaultfileblockbehaviordropid",
                                                                                                 "settingInstanceTemplateReference":  {
                                                                                                                                          "settingInstanceTemplateId":  "dd5c54d0-575f-41b6-98ec-bf386361d853"
                                                                                                                                      },
                                                                                                 "choiceSettingValue":  {
                                                                                                                            "value":  "user_vendor_msft_policy_config_ppt16v2~policy~l_microsoftofficepowerpoint~l_powerpointoptions~l_security~l_trustcenter~l_fileblocksettings_l_setdefaultfileblockbehavior_l_setdefaultfileblockbehaviordropid_0",
                                                                                                                            "settingValueTemplateReference":  {
                                                                                                                                                                  "settingValueTemplateId":  "d62d6867-60a8-4bf1-8c6b-d5ed43740a2a",
                                                                                                                                                                  "useTemplateDefault":  false
                                                                                                                                                              },
                                                                                                                            "children":  [

                                                                                                                                         ]
                                                                                                                        }
                                                                                             }
                                                                                         ]
                                                                        }
                                             }
                     },
                     {
                         "id":  "78",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "user_vendor_msft_policy_config_ppt16v2~policy~l_microsoftofficepowerpoint~l_powerpointoptions~l_security~l_trustcenter~l_protectedview_l_donotopenfilesfromtheinternetzoneinprotectedview",
                                                 "settingInstanceTemplateReference":  {
                                                                                          "settingInstanceTemplateId":  "a3f5a418-6301-47a8-91c2-21b581322632"
                                                                                      },
                                                 "choiceSettingValue":  {
                                                                            "value":  "user_vendor_msft_policy_config_ppt16v2~policy~l_microsoftofficepowerpoint~l_powerpointoptions~l_security~l_trustcenter~l_protectedview_l_donotopenfilesfromtheinternetzoneinprotectedview_0",
                                                                            "settingValueTemplateReference":  {
                                                                                                                  "settingValueTemplateId":  "00b60c89-494f-4126-9287-ac53994f62ed",
                                                                                                                  "useTemplateDefault":  false
                                                                                                              },
                                                                            "children":  [

                                                                                         ]
                                                                        }
                                             }
                     },
                     {
                         "id":  "79",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "user_vendor_msft_policy_config_ppt16v2~policy~l_microsoftofficepowerpoint~l_powerpointoptions~l_security~l_trustcenter~l_protectedview_l_donotopenfilesinunsafelocationsinprotectedview",
                                                 "settingInstanceTemplateReference":  {
                                                                                          "settingInstanceTemplateId":  "221c4200-e2a1-4a90-9202-b482a1ef894a"
                                                                                      },
                                                 "choiceSettingValue":  {
                                                                            "value":  "user_vendor_msft_policy_config_ppt16v2~policy~l_microsoftofficepowerpoint~l_powerpointoptions~l_security~l_trustcenter~l_protectedview_l_donotopenfilesinunsafelocationsinprotectedview_0",
                                                                            "settingValueTemplateReference":  {
                                                                                                                  "settingValueTemplateId":  "c85cad04-e43f-4f8c-82d4-e1d0bfcac117",
                                                                                                                  "useTemplateDefault":  false
                                                                                                              },
                                                                            "children":  [

                                                                                         ]
                                                                        }
                                             }
                     },
                     {
                         "id":  "80",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "user_vendor_msft_policy_config_ppt16v2~policy~l_microsoftofficepowerpoint~l_powerpointoptions~l_security~l_trustcenter~l_protectedview_l_setdocumentbehavioriffilevalidationfails",
                                                 "settingInstanceTemplateReference":  {
                                                                                          "settingInstanceTemplateId":  "2b4efb59-e388-4469-ba9e-2f8d54f34e14"
                                                                                      },
                                                 "choiceSettingValue":  {
                                                                            "value":  "user_vendor_msft_policy_config_ppt16v2~policy~l_microsoftofficepowerpoint~l_powerpointoptions~l_security~l_trustcenter~l_protectedview_l_setdocumentbehavioriffilevalidationfails_1",
                                                                            "settingValueTemplateReference":  {
                                                                                                                  "settingValueTemplateId":  "c3df9b33-d1ed-45b6-a8d6-32b5e80be3e4",
                                                                                                                  "useTemplateDefault":  false
                                                                                                              },
                                                                            "children":  [
                                                                                             {
                                                                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                 "settingDefinitionId":  "user_vendor_msft_policy_config_ppt16v2~policy~l_microsoftofficepowerpoint~l_powerpointoptions~l_security~l_trustcenter~l_protectedview_l_setdocumentbehavioriffilevalidationfails_l_setdocumentbehavioriffilevalidationfailsstr3",
                                                                                                 "settingInstanceTemplateReference":  {
                                                                                                                                          "settingInstanceTemplateId":  "d2779bd2-aeea-48f0-a005-1dcb835553aa"
                                                                                                                                      },
                                                                                                 "choiceSettingValue":  {
                                                                                                                            "value":  "user_vendor_msft_policy_config_ppt16v2~policy~l_microsoftofficepowerpoint~l_powerpointoptions~l_security~l_trustcenter~l_protectedview_l_setdocumentbehavioriffilevalidationfails_l_setdocumentbehavioriffilevalidationfailsstr3_0",
                                                                                                                            "settingValueTemplateReference":  {
                                                                                                                                                                  "settingValueTemplateId":  "32430f28-31f8-48c8-b2c9-cf541c0a1f64",
                                                                                                                                                                  "useTemplateDefault":  false
                                                                                                                                                              },
                                                                                                                            "children":  [

                                                                                                                                         ]
                                                                                                                        }
                                                                                             },
                                                                                             {
                                                                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                 "settingDefinitionId":  "user_vendor_msft_policy_config_ppt16v2~policy~l_microsoftofficepowerpoint~l_powerpointoptions~l_security~l_trustcenter~l_protectedview_l_setdocumentbehavioriffilevalidationfails_l_setdocumentbehavioriffilevalidationfailsdropid",
                                                                                                 "settingInstanceTemplateReference":  {
                                                                                                                                          "settingInstanceTemplateId":  "792e5903-d5de-4b83-88e7-98feeac87e25"
                                                                                                                                      },
                                                                                                 "choiceSettingValue":  {
                                                                                                                            "value":  "user_vendor_msft_policy_config_ppt16v2~policy~l_microsoftofficepowerpoint~l_powerpointoptions~l_security~l_trustcenter~l_protectedview_l_setdocumentbehavioriffilevalidationfails_l_setdocumentbehavioriffilevalidationfailsdropid_1",
                                                                                                                            "settingValueTemplateReference":  {
                                                                                                                                                                  "settingValueTemplateId":  "59791210-7f49-42a9-a93e-b79cf1d85e58",
                                                                                                                                                                  "useTemplateDefault":  false
                                                                                                                                                              },
                                                                                                                            "children":  [

                                                                                                                                         ]
                                                                                                                        }
                                                                                             }
                                                                                         ]
                                                                        }
                                             }
                     },
                     {
                         "id":  "81",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "user_vendor_msft_policy_config_ppt16v2~policy~l_microsoftofficepowerpoint~l_powerpointoptions~l_security~l_trustcenter~l_protectedview_l_turnoffprotectedviewforattachmentsopenedfromoutlook",
                                                 "settingInstanceTemplateReference":  {
                                                                                          "settingInstanceTemplateId":  "c1ee2665-858e-4081-8662-65cd0c4bb9c2"
                                                                                      },
                                                 "choiceSettingValue":  {
                                                                            "value":  "user_vendor_msft_policy_config_ppt16v2~policy~l_microsoftofficepowerpoint~l_powerpointoptions~l_security~l_trustcenter~l_protectedview_l_turnoffprotectedviewforattachmentsopenedfromoutlook_0",
                                                                            "settingValueTemplateReference":  {
                                                                                                                  "settingValueTemplateId":  "19b19e96-8c67-4c6b-bf20-6bc38a3d134a",
                                                                                                                  "useTemplateDefault":  false
                                                                                                              },
                                                                            "children":  [

                                                                                         ]
                                                                        }
                                             }
                     },
                     {
                         "id":  "82",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "user_vendor_msft_policy_config_ppt16v2~policy~l_microsoftofficepowerpoint~l_powerpointoptions~l_security~l_trustcenter~l_trustedlocations_l_allowtrustedlocationsonthenetwork",
                                                 "settingInstanceTemplateReference":  {
                                                                                          "settingInstanceTemplateId":  "cfbc8cea-2566-4f4f-a1ec-d201d5d953bb"
                                                                                      },
                                                 "choiceSettingValue":  {
                                                                            "value":  "user_vendor_msft_policy_config_ppt16v2~policy~l_microsoftofficepowerpoint~l_powerpointoptions~l_security~l_trustcenter~l_trustedlocations_l_allowtrustedlocationsonthenetwork_0",
                                                                            "settingValueTemplateReference":  {
                                                                                                                  "settingValueTemplateId":  "c161dc59-9450-426d-b5fa-e2c461ef49f6",
                                                                                                                  "useTemplateDefault":  false
                                                                                                              },
                                                                            "children":  [

                                                                                         ]
                                                                        }
                                             }
                     },
                     {
                         "id":  "83",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "user_vendor_msft_policy_config_ppt16v2~policy~l_microsoftofficepowerpoint~l_powerpointoptions~l_security~l_trustcenter_l_blockmacroexecutionfrominternet",
                                                 "settingInstanceTemplateReference":  {
                                                                                          "settingInstanceTemplateId":  "e48122c7-ee53-474c-9499-3ba634eb0d43"
                                                                                      },
                                                 "choiceSettingValue":  {
                                                                            "value":  "user_vendor_msft_policy_config_ppt16v2~policy~l_microsoftofficepowerpoint~l_powerpointoptions~l_security~l_trustcenter_l_blockmacroexecutionfrominternet_1",
                                                                            "settingValueTemplateReference":  {
                                                                                                                  "settingValueTemplateId":  "01779736-1dbf-4fec-a4da-806b0e009e60",
                                                                                                                  "useTemplateDefault":  false
                                                                                                              },
                                                                            "children":  [

                                                                                         ]
                                                                        }
                                             }
                     },
                     {
                         "id":  "84",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "user_vendor_msft_policy_config_ppt16v2~policy~l_microsoftofficepowerpoint~l_powerpointoptions~l_security~l_trustcenter_l_disabletrustbarnotificationforunsigned",
                                                 "settingInstanceTemplateReference":  {
                                                                                          "settingInstanceTemplateId":  "2a908b55-9eb5-433a-a38d-791cf50ad9ff"
                                                                                      },
                                                 "choiceSettingValue":  {
                                                                            "value":  "user_vendor_msft_policy_config_ppt16v2~policy~l_microsoftofficepowerpoint~l_powerpointoptions~l_security~l_trustcenter_l_disabletrustbarnotificationforunsigned_1",
                                                                            "settingValueTemplateReference":  {
                                                                                                                  "settingValueTemplateId":  "cd942729-61f6-4bac-84cd-904f9707df6a",
                                                                                                                  "useTemplateDefault":  false
                                                                                                              },
                                                                            "children":  [

                                                                                         ]
                                                                        }
                                             }
                     },
                     {
                         "id":  "85",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "user_vendor_msft_policy_config_ppt16v2~policy~l_microsoftofficepowerpoint~l_powerpointoptions~l_security~l_trustcenter_l_requirethatapplicationextensionsaresigned",
                                                 "settingInstanceTemplateReference":  {
                                                                                          "settingInstanceTemplateId":  "09caa41f-8f5f-4c60-ba8f-adc9abf7183b"
                                                                                      },
                                                 "choiceSettingValue":  {
                                                                            "value":  "user_vendor_msft_policy_config_ppt16v2~policy~l_microsoftofficepowerpoint~l_powerpointoptions~l_security~l_trustcenter_l_requirethatapplicationextensionsaresigned_1",
                                                                            "settingValueTemplateReference":  {
                                                                                                                  "settingValueTemplateId":  "6749cf9e-28be-4aa5-983e-fcef39faf678",
                                                                                                                  "useTemplateDefault":  false
                                                                                                              },
                                                                            "children":  [
                                                                                             {
                                                                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                 "settingDefinitionId":  "user_vendor_msft_policy_config_ppt16v2~policy~l_microsoftofficepowerpoint~l_powerpointoptions~l_security~l_trustcenter_l_disabletrustbarnotificationforunsigned_v2",
                                                                                                 "settingInstanceTemplateReference":  {
                                                                                                                                          "settingInstanceTemplateId":  "32634ece-1126-4d8a-a8a1-8c3638ec4923"
                                                                                                                                      },
                                                                                                 "choiceSettingValue":  {
                                                                                                                            "value":  "user_vendor_msft_policy_config_ppt16v2~policy~l_microsoftofficepowerpoint~l_powerpointoptions~l_security~l_trustcenter_l_disabletrustbarnotificationforunsigned_v2_1",
                                                                                                                            "settingValueTemplateReference":  {
                                                                                                                                                                  "settingValueTemplateId":  "8594c416-9dfd-47e3-8bd1-1bc6e45ca503",
                                                                                                                                                                  "useTemplateDefault":  false
                                                                                                                                                              },
                                                                                                                            "children":  [

                                                                                                                                         ]
                                                                                                                        }
                                                                                             }
                                                                                         ]
                                                                        }
                                             }
                     },
                     {
                         "id":  "86",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "user_vendor_msft_policy_config_ppt16v2~policy~l_microsoftofficepowerpoint~l_powerpointoptions~l_security~l_trustcenter_l_vbawarningspolicy",
                                                 "settingInstanceTemplateReference":  {
                                                                                          "settingInstanceTemplateId":  "4b9fd403-2190-4ed9-aad1-82ed60a3dd17"
                                                                                      },
                                                 "choiceSettingValue":  {
                                                                            "value":  "user_vendor_msft_policy_config_ppt16v2~policy~l_microsoftofficepowerpoint~l_powerpointoptions~l_security~l_trustcenter_l_vbawarningspolicy_1",
                                                                            "settingValueTemplateReference":  {
                                                                                                                  "settingValueTemplateId":  "133410e9-55b8-4d5d-8f77-72ab1716e71d",
                                                                                                                  "useTemplateDefault":  false
                                                                                                              },
                                                                            "children":  [
                                                                                             {
                                                                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                 "settingDefinitionId":  "user_vendor_msft_policy_config_ppt16v2~policy~l_microsoftofficepowerpoint~l_powerpointoptions~l_security~l_trustcenter_l_vbawarningspolicy_l_empty3",
                                                                                                 "settingInstanceTemplateReference":  {
                                                                                                                                          "settingInstanceTemplateId":  "2a56cc6d-2a8f-4217-9897-28c310bc2ca4"
                                                                                                                                      },
                                                                                                 "choiceSettingValue":  {
                                                                                                                            "value":  "user_vendor_msft_policy_config_ppt16v2~policy~l_microsoftofficepowerpoint~l_powerpointoptions~l_security~l_trustcenter_l_vbawarningspolicy_l_empty3_3",
                                                                                                                            "settingValueTemplateReference":  {
                                                                                                                                                                  "settingValueTemplateId":  "239db0b5-b45a-4ed7-9acb-de7fb64847b2",
                                                                                                                                                                  "useTemplateDefault":  false
                                                                                                                                                              },
                                                                                                                            "children":  [

                                                                                                                                         ]
                                                                                                                        }
                                                                                             }
                                                                                         ]
                                                                        }
                                             }
                     },
                     {
                         "id":  "87",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "user_vendor_msft_policy_config_ppt16v2~policy~l_microsoftofficepowerpoint~l_powerpointoptions~l_security_l_runprograms",
                                                 "settingInstanceTemplateReference":  {
                                                                                          "settingInstanceTemplateId":  "adbd0915-1f0b-4f59-a907-4c57bf4c4b38"
                                                                                      },
                                                 "choiceSettingValue":  {
                                                                            "value":  "user_vendor_msft_policy_config_ppt16v2~policy~l_microsoftofficepowerpoint~l_powerpointoptions~l_security_l_runprograms_0",
                                                                            "settingValueTemplateReference":  {
                                                                                                                  "settingValueTemplateId":  "c6fcc783-c797-493d-9a59-19c9c7445943",
                                                                                                                  "useTemplateDefault":  false
                                                                                                              },
                                                                            "children":  [

                                                                                         ]
                                                                        }
                                             }
                     },
                     {
                         "id":  "88",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "user_vendor_msft_policy_config_ppt16v2~policy~l_microsoftofficepowerpoint~l_powerpointoptions~l_security_l_determinewhethertoforceencryptedppt",
                                                 "settingInstanceTemplateReference":  {
                                                                                          "settingInstanceTemplateId":  "c044fd43-9cfe-46af-b9f3-d4b5d3991cc9"
                                                                                      },
                                                 "choiceSettingValue":  {
                                                                            "value":  "user_vendor_msft_policy_config_ppt16v2~policy~l_microsoftofficepowerpoint~l_powerpointoptions~l_security_l_determinewhethertoforceencryptedppt_1",
                                                                            "settingValueTemplateReference":  {
                                                                                                                  "settingValueTemplateId":  "0224ae5d-7fd7-4bd7-9011-b91ee8724a5c",
                                                                                                                  "useTemplateDefault":  false
                                                                                                              },
                                                                            "children":  [
                                                                                             {
                                                                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                 "settingDefinitionId":  "user_vendor_msft_policy_config_ppt16v2~policy~l_microsoftofficepowerpoint~l_powerpointoptions~l_security_l_determinewhethertoforceencryptedppt_l_determinewhethertoforceencryptedpptdropid",
                                                                                                 "settingInstanceTemplateReference":  {
                                                                                                                                          "settingInstanceTemplateId":  "d9fba16b-3a26-4a80-a223-220b724c8ea3"
                                                                                                                                      },
                                                                                                 "choiceSettingValue":  {
                                                                                                                            "value":  "user_vendor_msft_policy_config_ppt16v2~policy~l_microsoftofficepowerpoint~l_powerpointoptions~l_security_l_determinewhethertoforceencryptedppt_l_determinewhethertoforceencryptedpptdropid_0",
                                                                                                                            "settingValueTemplateReference":  {
                                                                                                                                                                  "settingValueTemplateId":  "ba5451e9-4978-4a49-830d-341ab4585314",
                                                                                                                                                                  "useTemplateDefault":  false
                                                                                                                                                              },
                                                                                                                            "children":  [

                                                                                                                                         ]
                                                                                                                        }
                                                                                             }
                                                                                         ]
                                                                        }
                                             }
                     },
                     {
                         "id":  "89",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "user_vendor_msft_policy_config_ppt16v2~policy~l_microsoftofficepowerpoint~l_powerpointoptions~l_security_l_turnofffilevalidation",
                                                 "settingInstanceTemplateReference":  {
                                                                                          "settingInstanceTemplateId":  "9be10857-acfe-450c-92f9-9617ca0cdbec"
                                                                                      },
                                                 "choiceSettingValue":  {
                                                                            "value":  "user_vendor_msft_policy_config_ppt16v2~policy~l_microsoftofficepowerpoint~l_powerpointoptions~l_security_l_turnofffilevalidation_0",
                                                                            "settingValueTemplateReference":  {
                                                                                                                  "settingValueTemplateId":  "790d66cc-f2c5-470b-8abd-5fdc2d436548",
                                                                                                                  "useTemplateDefault":  false
                                                                                                              },
                                                                            "children":  [

                                                                                         ]
                                                                        }
                                             }
                     }
                 ]
}
