{
    "description":  "",
    "name":  "M365 Baseline - Visio",
    "platforms":  "windows10",
    "technologies":  "mdm",
    "templateReference":  {
                              "templateId":  "90316f12-246d-44c6-a767-f87692e86083_2",
                              "templateFamily":  "baseline",
                              "templateDisplayName":  "Microsoft 365 Apps for Enterprise Security Baseline",
                              "templateDisplayVersion":  "Version 2306"
                          },
    "roleScopeTagIds":  [
                            "0"
                        ],
    "settings":  [
                     {
                         "id":  "99",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "user_vendor_msft_policy_config_visio16v2~policy~l_microsoftvisio~l_visiooptions~l_security~l_trustcenter~l_fileblocksettings_l_visio2000files",
                                                 "settingInstanceTemplateReference":  {
                                                                                          "settingInstanceTemplateId":  "f9c19d0e-17e6-429b-ba87-d45064351c57"
                                                                                      },
                                                 "choiceSettingValue":  {
                                                                            "value":  "user_vendor_msft_policy_config_visio16v2~policy~l_microsoftvisio~l_visiooptions~l_security~l_trustcenter~l_fileblocksettings_l_visio2000files_1",
                                                                            "settingValueTemplateReference":  {
                                                                                                                  "settingValueTemplateId":  "c688540b-50f2-419d-92ac-c552e5a09703",
                                                                                                                  "useTemplateDefault":  false
                                                                                                              },
                                                                            "children":  [
                                                                                             {
                                                                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                 "settingDefinitionId":  "user_vendor_msft_policy_config_visio16v2~policy~l_microsoftvisio~l_visiooptions~l_security~l_trustcenter~l_fileblocksettings_l_visio2000files_l_visio2000filesdropid",
                                                                                                 "settingInstanceTemplateReference":  {
                                                                                                                                          "settingInstanceTemplateId":  "807bfd8a-8909-4d1c-a694-8556d139fd07"
                                                                                                                                      },
                                                                                                 "choiceSettingValue":  {
                                                                                                                            "value":  "user_vendor_msft_policy_config_visio16v2~policy~l_microsoftvisio~l_visiooptions~l_security~l_trustcenter~l_fileblocksettings_l_visio2000files_l_visio2000filesdropid_2",
                                                                                                                            "settingValueTemplateReference":  {
                                                                                                                                                                  "settingValueTemplateId":  "86f5eeab-80d8-4be8-b295-6d2617b65b38",
                                                                                                                                                                  "useTemplateDefault":  false
                                                                                                                                                              },
                                                                                                                            "children":  [

                                                                                                                                         ]
                                                                                                                        }
                                                                                             }
                                                                                         ]
                                                                        }
                                             }
                     },
                     {
                         "id":  "100",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "user_vendor_msft_policy_config_visio16v2~policy~l_microsoftvisio~l_visiooptions~l_security~l_trustcenter~l_fileblocksettings_l_visio2003files",
                                                 "settingInstanceTemplateReference":  {
                                                                                          "settingInstanceTemplateId":  "d6350fb1-e259-47a5-b40c-20b131059074"
                                                                                      },
                                                 "choiceSettingValue":  {
                                                                            "value":  "user_vendor_msft_policy_config_visio16v2~policy~l_microsoftvisio~l_visiooptions~l_security~l_trustcenter~l_fileblocksettings_l_visio2003files_1",
                                                                            "settingValueTemplateReference":  {
                                                                                                                  "settingValueTemplateId":  "769df304-68c6-40cc-925f-f0fd113bbbd6",
                                                                                                                  "useTemplateDefault":  false
                                                                                                              },
                                                                            "children":  [
                                                                                             {
                                                                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                 "settingDefinitionId":  "user_vendor_msft_policy_config_visio16v2~policy~l_microsoftvisio~l_visiooptions~l_security~l_trustcenter~l_fileblocksettings_l_visio2003files_l_visio2003filesdropid",
                                                                                                 "settingInstanceTemplateReference":  {
                                                                                                                                          "settingInstanceTemplateId":  "1e762182-5075-425f-bbbf-c3e485293958"
                                                                                                                                      },
                                                                                                 "choiceSettingValue":  {
                                                                                                                            "value":  "user_vendor_msft_policy_config_visio16v2~policy~l_microsoftvisio~l_visiooptions~l_security~l_trustcenter~l_fileblocksettings_l_visio2003files_l_visio2003filesdropid_2",
                                                                                                                            "settingValueTemplateReference":  {
                                                                                                                                                                  "settingValueTemplateId":  "2c432dc4-f266-4c70-b973-f3544fcf62e2",
                                                                                                                                                                  "useTemplateDefault":  false
                                                                                                                                                              },
                                                                                                                            "children":  [

                                                                                                                                         ]
                                                                                                                        }
                                                                                             }
                                                                                         ]
                                                                        }
                                             }
                     },
                     {
                         "id":  "101",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "user_vendor_msft_policy_config_visio16v2~policy~l_microsoftvisio~l_visiooptions~l_security~l_trustcenter~l_fileblocksettings_l_visio50andearlierfiles",
                                                 "settingInstanceTemplateReference":  {
                                                                                          "settingInstanceTemplateId":  "706ceec6-eeee-44c9-a2c5-a987f60944ee"
                                                                                      },
                                                 "choiceSettingValue":  {
                                                                            "value":  "user_vendor_msft_policy_config_visio16v2~policy~l_microsoftvisio~l_visiooptions~l_security~l_trustcenter~l_fileblocksettings_l_visio50andearlierfiles_1",
                                                                            "settingValueTemplateReference":  {
                                                                                                                  "settingValueTemplateId":  "f7012573-da1c-40b6-99d9-798bce940cb3",
                                                                                                                  "useTemplateDefault":  false
                                                                                                              },
                                                                            "children":  [
                                                                                             {
                                                                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                 "settingDefinitionId":  "user_vendor_msft_policy_config_visio16v2~policy~l_microsoftvisio~l_visiooptions~l_security~l_trustcenter~l_fileblocksettings_l_visio50andearlierfiles_l_visio50andearlierfilesdropid",
                                                                                                 "settingInstanceTemplateReference":  {
                                                                                                                                          "settingInstanceTemplateId":  "9d97cddd-288d-407e-96c5-2ac81d9b2a12"
                                                                                                                                      },
                                                                                                 "choiceSettingValue":  {
                                                                                                                            "value":  "user_vendor_msft_policy_config_visio16v2~policy~l_microsoftvisio~l_visiooptions~l_security~l_trustcenter~l_fileblocksettings_l_visio50andearlierfiles_l_visio50andearlierfilesdropid_2",
                                                                                                                            "settingValueTemplateReference":  {
                                                                                                                                                                  "settingValueTemplateId":  "bb48641f-c097-4062-a0cf-e7e4e44a48da",
                                                                                                                                                                  "useTemplateDefault":  false
                                                                                                                                                              },
                                                                                                                            "children":  [

                                                                                                                                         ]
                                                                                                                        }
                                                                                             }
                                                                                         ]
                                                                        }
                                             }
                     },
                     {
                         "id":  "102",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "user_vendor_msft_policy_config_visio16v2~policy~l_microsoftvisio~l_visiooptions~l_security~l_trustcenter_l_allowtrustedlocationsonthenetwork",
                                                 "settingInstanceTemplateReference":  {
                                                                                          "settingInstanceTemplateId":  "48d3a212-de54-4f7f-a19c-c2a24fac0def"
                                                                                      },
                                                 "choiceSettingValue":  {
                                                                            "value":  "user_vendor_msft_policy_config_visio16v2~policy~l_microsoftvisio~l_visiooptions~l_security~l_trustcenter_l_allowtrustedlocationsonthenetwork_0",
                                                                            "settingValueTemplateReference":  {
                                                                                                                  "settingValueTemplateId":  "ac7c0449-4cfb-4671-b87b-8b8c91838015",
                                                                                                                  "useTemplateDefault":  false
                                                                                                              },
                                                                            "children":  [

                                                                                         ]
                                                                        }
                                             }
                     },
                     {
                         "id":  "103",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "user_vendor_msft_policy_config_visio16v2~policy~l_microsoftvisio~l_visiooptions~l_security~l_trustcenter_l_blockmacroexecutionfrominternet",
                                                 "settingInstanceTemplateReference":  {
                                                                                          "settingInstanceTemplateId":  "f279701b-77ec-4b30-8fc3-4698a17be33e"
                                                                                      },
                                                 "choiceSettingValue":  {
                                                                            "value":  "user_vendor_msft_policy_config_visio16v2~policy~l_microsoftvisio~l_visiooptions~l_security~l_trustcenter_l_blockmacroexecutionfrominternet_1",
                                                                            "settingValueTemplateReference":  {
                                                                                                                  "settingValueTemplateId":  "c49af1c5-2d13-48ce-a566-f36d8fea85f5",
                                                                                                                  "useTemplateDefault":  false
                                                                                                              },
                                                                            "children":  [

                                                                                         ]
                                                                        }
                                             }
                     },
                     {
                         "id":  "104",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "user_vendor_msft_policy_config_visio16v2~policy~l_microsoftvisio~l_visiooptions~l_security~l_trustcenter_l_disabletrustbarnotificationforunsigned",
                                                 "settingInstanceTemplateReference":  {
                                                                                          "settingInstanceTemplateId":  "b0eb17b7-8e2e-4065-b954-7854a62995e6"
                                                                                      },
                                                 "choiceSettingValue":  {
                                                                            "value":  "user_vendor_msft_policy_config_visio16v2~policy~l_microsoftvisio~l_visiooptions~l_security~l_trustcenter_l_disabletrustbarnotificationforunsigned_1",
                                                                            "settingValueTemplateReference":  {
                                                                                                                  "settingValueTemplateId":  "e74b11f6-0c07-4bf2-bfc3-9df4387e41b9",
                                                                                                                  "useTemplateDefault":  false
                                                                                                              },
                                                                            "children":  [

                                                                                         ]
                                                                        }
                                             }
                     },
                     {
                         "id":  "105",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "user_vendor_msft_policy_config_visio16v2~policy~l_microsoftvisio~l_visiooptions~l_security~l_trustcenter_l_requirethatapplicationextensionsaresigned",
                                                 "settingInstanceTemplateReference":  {
                                                                                          "settingInstanceTemplateId":  "82080fab-c75e-41f9-8672-9be5b5b2861e"
                                                                                      },
                                                 "choiceSettingValue":  {
                                                                            "value":  "user_vendor_msft_policy_config_visio16v2~policy~l_microsoftvisio~l_visiooptions~l_security~l_trustcenter_l_requirethatapplicationextensionsaresigned_1",
                                                                            "settingValueTemplateReference":  {
                                                                                                                  "settingValueTemplateId":  "f3f89d06-57ea-4b97-bf17-ab661ff0aada",
                                                                                                                  "useTemplateDefault":  false
                                                                                                              },
                                                                            "children":  [
                                                                                             {
                                                                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                 "settingDefinitionId":  "user_vendor_msft_policy_config_visio16v2~policy~l_microsoftvisio~l_visiooptions~l_security~l_trustcenter_l_disabletrustbarnotificationforunsigned_v2",
                                                                                                 "settingInstanceTemplateReference":  {
                                                                                                                                          "settingInstanceTemplateId":  "91224280-4cb4-435f-8ae8-7c03e5b7b507"
                                                                                                                                      },
                                                                                                 "choiceSettingValue":  {
                                                                                                                            "value":  "user_vendor_msft_policy_config_visio16v2~policy~l_microsoftvisio~l_visiooptions~l_security~l_trustcenter_l_disabletrustbarnotificationforunsigned_v2_1",
                                                                                                                            "settingValueTemplateReference":  {
                                                                                                                                                                  "settingValueTemplateId":  "24848828-cc9b-4988-8c38-4983394420e3",
                                                                                                                                                                  "useTemplateDefault":  false
                                                                                                                                                              },
                                                                                                                            "children":  [

                                                                                                                                         ]
                                                                                                                        }
                                                                                             }
                                                                                         ]
                                                                        }
                                             }
                     },
                     {
                         "id":  "106",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "user_vendor_msft_policy_config_visio16v2~policy~l_microsoftvisio~l_visiooptions~l_security~l_trustcenter_l_vbawarningspolicy",
                                                 "settingInstanceTemplateReference":  {
                                                                                          "settingInstanceTemplateId":  "027f0348-056a-4f5d-93ad-4243d886055d"
                                                                                      },
                                                 "choiceSettingValue":  {
                                                                            "value":  "user_vendor_msft_policy_config_visio16v2~policy~l_microsoftvisio~l_visiooptions~l_security~l_trustcenter_l_vbawarningspolicy_1",
                                                                            "settingValueTemplateReference":  {
                                                                                                                  "settingValueTemplateId":  "21eb6857-820e-4881-8433-a4dc6bec3b37",
                                                                                                                  "useTemplateDefault":  false
                                                                                                              },
                                                                            "children":  [
                                                                                             {
                                                                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                 "settingDefinitionId":  "user_vendor_msft_policy_config_visio16v2~policy~l_microsoftvisio~l_visiooptions~l_security~l_trustcenter_l_vbawarningspolicy_l_empty",
                                                                                                 "settingInstanceTemplateReference":  {
                                                                                                                                          "settingInstanceTemplateId":  "7bdd97bb-3940-475e-a459-5bc933ef1509"
                                                                                                                                      },
                                                                                                 "choiceSettingValue":  {
                                                                                                                            "value":  "user_vendor_msft_policy_config_visio16v2~policy~l_microsoftvisio~l_visiooptions~l_security~l_trustcenter_l_vbawarningspolicy_l_empty_3",
                                                                                                                            "settingValueTemplateReference":  {
                                                                                                                                                                  "settingValueTemplateId":  "4586e284-b69e-4f17-9ccd-b855cc24d5f7",
                                                                                                                                                                  "useTemplateDefault":  false
                                                                                                                                                              },
                                                                                                                            "children":  [

                                                                                                                                         ]
                                                                                                                        }
                                                                                             }
                                                                                         ]
                                                                        }
                                             }
                     }
                 ]
}
