{
  "@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity",
  "createdDateTime": "2025-02-19T11:40:33.499281Z",
  "creationSource": null,
  "description": "",
  "lastModifiedDateTime": "2025-02-19T11:40:33.499281Z",
  "name": "Security Baseline 25H2 - Device Lock",
  "platforms": "windows10",
  "priorityMetaData": null,
  "roleScopeTagIds": ["0"],
  "settingCount": 1,
  "technologies": "mdm",
  "id": "bc8408c5-ee57-4a77-8f55-dfb04e2bbbd5",
  "templateReference": {
    "templateId": "",
    "templateFamily": "none",
    "templateDisplayName": null,
    "templateDisplayVersion": null
  },
  "settings": [
    {
      "id": "0",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_devicelock_devicepasswordenabled",
        "settingInstanceTemplateReference": null,
        "choiceSettingValue": {
          "settingValueTemplateReference": null,
          "value": "device_vendor_msft_policy_config_devicelock_devicepasswordenabled_0",
          "children": [
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
              "settingDefinitionId": "device_vendor_msft_policy_config_devicelock_devicepasswordhistory",
              "settingInstanceTemplateReference": null,
              "simpleSettingValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 24
              }
            },
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
              "settingDefinitionId": "device_vendor_msft_policy_config_devicelock_mindevicepasswordlength",
              "settingInstanceTemplateReference": null,
              "simpleSettingValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 14
              }
            }
          ]
        }
      }
    }
  ]
}
